//
//  ItemsArray.swift
//  AccountingAPP
//
//  Created by 塗詠順 on 2022/2/13.
//
//let incomeCategoryItems: [String] = [
//    "工作收入",
//    "投資收入",
//    "其他收入"
//]
//
//let incomeSubTypeItems: [String: [String]] = [
//    "工作收入" : ["薪水收入", "外快收入", "年終獎金"],
//    "投資收入" : ["股利股息收入", "基金", "房地產", "銀行利息收入"],
//    "其他收入" : ["禮金", "彩票"]
//]
//
//let expenditureCategoryItems: [String] = [
//    "食品酒水",
//    "居家物業",
//    "行車交通",
//    "交流通訊",
//    "休閒娛樂",
//    "進修學習",
//    "人情往來",
//    "醫療保健",
//    "金融保險",
//    "其他雜項"
//]
//
//let expenditureSubTypeItems: [String: [String]] = [
//    "食品酒水" : ["早餐", "午餐", "晚餐", "菸酒茶飲料", "水果零食"],
//    "居家物業" : ["日常用品", "水電瓦斯", "房租房貸"],
//    "行車交通" : ["公共交通費", "計程車費", "汽機車加油費", "火車飛機費"],
//    "交流通訊" : ["電話費", "手機費", "網路費", "有線電視費"],
//    "休閒娛樂" : ["運動健身", "朋友聚會", "休閒玩樂", "寵物寶貝", "旅遊度假", "奢侈敗家", "穿搭衣物"],
//    "進修學習" : ["書籍雜誌", "上課進修", "網路學習"],
//    "人情往來" : ["送禮請客", "孝親", "慈善捐款"],
//    "醫療保健" : ["生病療診", "勞健保", "保險費", "健康食品", "養顏美容"],
//    "金融保險" : ["銀行手續", "分期付款", "投資損益", "稅捐支出", "賠償罰款"],
//    "其他雜項" : ["其他費用", "遺失損失", "借錢要不到(難受)"]
//]

let incomeCategoryItems: [String] = [
    "收入",
    "投資收入",
    "其他收入"
]

let incomeSubTypeItems: [String: [String]] = [
    "收入" : ["當天營收"],
    "投資收入" : ["股利股息收入", "基金", "房地產", "銀行利息收入"],
    "其他收入" : ["禮金", "彩票"]
]

let incomeProjectItems: [String] = [
    "現金",
    "FoodPanda-30%",
    "Uber-34%"
]

let expenditureCategoryItems: [String] = [
    "食材",
    "人力",
    "房租水電",
    "廣告",
    "雜費",
    "餐具",
    "稅金"
]

let expenditureSubTypeItems: [String: [String]] = [
    "食材" : ["雞肉", "鮭魚", "鮪魚", "旗魚", "紅甘", "蝦子", "蝦卵", "黑豆", "海菜", "蟹肉", "蔬菜", "冷凍蔬菜", "南北貨", "蛋", "醬料", "米"],
    "人力" : ["員工薪水", "勞健保"],
    "房租水電" : ["房租", "水電"],
    "廣告" : ["FaceBook", "DM", "貼紙"],
    "雜費" : ["網路費", "電話費", "瓦斯費", "轉帳手續費", "提款手續費", "垃圾袋", "耐熱袋", "手套", "感熱紙", "衛生紙", "瓦斯", "其它"],
    "餐具" : ["紙碗", "紙碗蓋", "湯碗蓋", "湯碗", "叉子", "背心袋"],
    "稅金" : ["營業稅"]
]

let bankItems: [String] = [
"店現金",
"國泰世華",
"中國信託"
]


